import React from 'react';
import './UserOutput.css'

const userOutput = (props) => {
    return (
        <div className="UserOutput">
            <p>Το αγαπημένo απόσπασμα του {props.username}, o οποιός είναι {props.job}: Τὸ φῶς τῆς ἡμέρας ἦρθεν ἀργά, λογχίζοντας τ' ἀκάρφωτα ξυλοκεράμιδα τῆς σκεπῆς καὶ τὶς ὀρθάνοιχτες ἀστρέχες καὶ τὴ σαρακοφαγωμένη χαμηλόπορτα, νὰ χυθῇ πάναγνο στὸ βρωμερὸ κατάλυμα τῶν ζητιάνων. Ὁ Τζιριτόκωστας ἔπειτ' ἀπὸ τὸ ἄφθονο φαγοπότι, ἔπεσε ξαπλωταριὰ γιγάντια ἐπάνω στὸ μαλακὸν ἀχυρόστρωμα καὶ ἀμέσως ἀποκοιμήθηκε. Τὸ σκοτάδι πυκνότατο καὶ ὑγρὸ μὲ τὴ βαρειὰ ὀσμὴ τοῦ σάπιου ἄχυρου καὶ τοῦ κατούρου τὴν ἄχνα, ποὺ πολυκαιρινὴ ἐκαθόταν ἐκεῖ, ἐρρίχθηκαν κι ἐσκέπασαν ὅλον τὸν στενόμακρον ἀχυρῶνα ἕως τοὺς νοτισμένους τοίχους καὶ τὴν ἀραχνιασμένη σκεπὴ μὲ τύφλα καὶ μυστήριον.</p> 
            <p>Ἀλλὰ τὸ φῶς χύνεται τόρα κάτασπρο στὰ μαυρειδερὰ κουρέλια τῆς φορεσιᾶς καὶ τὰ μελαχροινὰ κρέατα, ἕως τὸ πρόσωπον ἐπάνω καὶ μὲ τὸ κεφάλι τοῦ ζητιάνου, σὰν νὰ θέλῃ περίεργο νὰ ἰδῇ, ἄν ἄφισε μὲ τὸν ὕπνο τὴν ψευτιὰ ἤ τὴν κρατεῖ πολυάκριβη ἐπάνω του, ὅπως καὶ τὴ φορεσιά του. Ἀλλὰ κοιμᾶται ἥσυχος ὁ Τζιριτόκωστας μὲ τὰ σκέλια χαυδωτά, τὰ χέρια ἀνοιγμένα ζερβόδεξα, λὲς καὶ πάσχει ν' ἀγκαλιάσῃ τὸ ἄπειρο γιὰ νὰ τὸ ρίξῃ στὸ σακκοῦλι του· τὸ πρόσωπο γυρισμένο ἀπίστομα, τὸ σῶμα σύψυχα παραδομένο στοῦ ὕπνου τὴν χαλυβένια δύναμη...</p>
        </div>
    );
};

export default userOutput;